Longan-Labs/Longan-SAMD-Boards/Longan-samd-1.0.3/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# CANBed M0
# --------------------------------------
CANBed_M0.name=CANBed M0 (ATSAMD21G18)
CANBed_M0.vid.0=0x2341
CANBed_M0.pid.0=0x804d
CANBed_M0.vid.1=0x2341
CANBed_M0.pid.1=0x004d
CANBed_M0.vid.2=0x2341
CANBed_M0.pid.2=0x824d
CANBed_M0.vid.3=0x2341
CANBed_M0.pid.3=0x024d

CANBed_M0.upload.tool=bossac
CANBed_M0.upload.protocol=sam-ba
CANBed_M0.upload.maximum_size=262144
CANBed_M0.upload.maximum_data_size=32768
CANBed_M0.upload.use_1200bps_touch=true
CANBed_M0.upload.wait_for_upload_port=true
CANBed_M0.upload.native_usb=true
CANBed_M0.build.mcu=cortex-m0plus
CANBed_M0.build.f_cpu=48000000L
CANBed_M0.build.usb_product="CANBed M0"
CANBed_M0.build.usb_manufacturer="Longan Labs"
CANBed_M0.build.board=SAMD_ZERO
CANBed_M0.build.core=arduino
CANBed_M0.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
CANBed_M0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
CANBed_M0.build.openocdscript=openocd_scripts/arduino_zero.cfg
CANBed_M0.build.variant=arduino_zero
CANBed_M0.build.variant_system_lib=
CANBed_M0.build.vid=0x2341
CANBed_M0.build.pid=0x804d
CANBed_M0.bootloader.tool=openocd
CANBed_M0.bootloader.file=zero/samd21_sam_ba.bin

# Squama Ethernet
# --------------------------------------
Squama_Ethernet.name=Squama Ethernet (ATSAMD21G18)
Squama_Ethernet.vid.0=0x2341
Squama_Ethernet.pid.0=0x804d
Squama_Ethernet.vid.1=0x2341
Squama_Ethernet.pid.1=0x004d
Squama_Ethernet.vid.2=0x2341
Squama_Ethernet.pid.2=0x824d
Squama_Ethernet.vid.3=0x2341
Squama_Ethernet.pid.3=0x024d

Squama_Ethernet.upload.tool=bossac
Squama_Ethernet.upload.protocol=sam-ba
Squama_Ethernet.upload.maximum_size=262144
Squama_Ethernet.upload.maximum_data_size=32768
Squama_Ethernet.upload.use_1200bps_touch=true
Squama_Ethernet.upload.wait_for_upload_port=true
Squama_Ethernet.upload.native_usb=true
Squama_Ethernet.build.mcu=cortex-m0plus
Squama_Ethernet.build.f_cpu=48000000L
Squama_Ethernet.build.usb_product="Squama Ethernet"
Squama_Ethernet.build.usb_manufacturer="Longan Labs"
Squama_Ethernet.build.board=SAMD_ZERO
Squama_Ethernet.build.core=arduino
Squama_Ethernet.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
Squama_Ethernet.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Squama_Ethernet.build.openocdscript=openocd_scripts/arduino_zero.cfg
Squama_Ethernet.build.variant=arduino_zero
Squama_Ethernet.build.variant_system_lib=
Squama_Ethernet.build.vid=0x2341
Squama_Ethernet.build.pid=0x804d
Squama_Ethernet.bootloader.tool=openocd
Squama_Ethernet.bootloader.file=zero/samd21_sam_ba.bin

# Longan OBD-II Basic Board
# --------------------------------------
Longan_OBD.name=Longan OBD-II Basic Board (ATSAMD21G18)
Longan_OBD.vid.0=0x2341
Longan_OBD.pid.0=0x804d
Longan_OBD.vid.1=0x2341
Longan_OBD.pid.1=0x004d
Longan_OBD.vid.2=0x2341
Longan_OBD.pid.2=0x824d
Longan_OBD.vid.3=0x2341
Longan_OBD.pid.3=0x024d

Longan_OBD.upload.tool=bossac
Longan_OBD.upload.protocol=sam-ba
Longan_OBD.upload.maximum_size=262144
Longan_OBD.upload.maximum_data_size=32768
Longan_OBD.upload.use_1200bps_touch=true
Longan_OBD.upload.wait_for_upload_port=true
Longan_OBD.upload.native_usb=true
Longan_OBD.build.mcu=cortex-m0plus
Longan_OBD.build.f_cpu=48000000L
Longan_OBD.build.usb_product="Longan OBD-II"
Longan_OBD.build.usb_manufacturer="Longan Labs"
Longan_OBD.build.board=SAMD_ZERO
Longan_OBD.build.core=arduino
Longan_OBD.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
Longan_OBD.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Longan_OBD.build.openocdscript=openocd_scripts/arduino_zero.cfg
Longan_OBD.build.variant=arduino_zero
Longan_OBD.build.variant_system_lib=
Longan_OBD.build.vid=0x2341
Longan_OBD.build.pid=0x804d
Longan_OBD.bootloader.tool=openocd
Longan_OBD.bootloader.file=zero/samd21_sam_ba.bin